app/views/articles/index.html.haml

    %td
      = raw article.tags.map(&:name).map { |t| link_to t, tag_path(t) }.join (', ')
---
SELECT tags.*, count(taggings.tag_id) as count FROM `tags` INNER JOIN `taggings` ON `taggings`.`tag_id` = `tags`.`id` GROUP BY taggings.tag_id