app/controllers/articles_controller.rb

  def index
    if params[:tag]
    @articles = Article.tagged_with(params[:tag])
    else
    @articles = Article.all
---
SELECT `articles`.* FROM `articles` JOIN taggings articles_taggings_fe3fc70 ON articles_taggings_fe3fc70.taggable_id = articles.id AND articles_taggings_fe3fc70.taggable_type = 'Article' AND articles_taggings_fe3fc70.tag_id = 1
SELECT tags.*, taggings.tags_count AS count FROM `tags` JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM `taggings` INNER JOIN articles ON articles.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Article' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT articles.id FROM `articles` )) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id

  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save
---
INSERT INTO `articles` (`content`, `created_at`, `nome`, `updated_at`) VALUES ('Batman é um super-herói, personagem de histórias em quadrinhos publicadas pela editora norte-americana DC Comics, cuja primeira aparição alguns acreditam ter sido em desenhos de Frank Foster em 1932, e publicado, em maio de 1939, na revista Detective Comics #27. Mais tarde, juntamente com a revista Superman (também da DC Comics) e Homem-Aranha (da Marvel Comics), Batman seria um dos mais conhecidos super-heróis do mundo. Batman foi co-criado pelo desenhista Bob Kane e o escritor Bill Finger. Fã da cultura vampiresca, especialmente das histórias ligadas ao personagem conhecido como Drácula, Kane imaginou um herói baseado no mesmo, com roupas negras, mas foi Finger que deu ao personagem o formato que o consagrou. Apesar de oficialmente creditado a Bob Kane, os desenhos de Frank Foster II, artista ligado a indústria de publicações de Nova Iorque na década de 1930, foram considerados autênticos pela DC Comics.', '2013-02-19 13:51:18', 'Batman', '2013-02-19 13:51:18')

  def update
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 2 LIMIT 1
UPDATE `articles` SET `content` = 'Superman (traduzido como Super-Homem) é um personagem, cujas histórias em quadrinhos são publicadas pela editora estadunidense DC Comics, uma empresa subsidiária do grupo Time Warner. Superman, entretanto, já foi adaptado para diversos outros meios, como cinema, rádio, televisão, literatura e Video game. Superman é um super-herói criado pela dupla de autores de quadrinhos Joe Shuster e Jerry Siegel. Sua primeira aparição foi apresentada na revista Action Comics #1 em 1938, nos Estados Unidos. O personagem nasceu no fictício planeta Krypton e foi chamado pelos seus pais de Kal-El (que significaria Filho das Estrelas no idioma kryptoniano).', `updated_at` = '2013-02-19 15:34:08' WHERE `articles`.`id` = 2